#  <font color=red> Module_01_建立資料框與資料框的基本操作</font>

## 建立資料框物件

In [1]:
import pandas as pd
import numpy as np

a = pd.DataFrame(np.arange(1,6))
a

   0
0  1
1  2
2  3
3  4
4  5

In [2]:
a.shape

(5, 1)

In [3]:
a.size

5

In [4]:
len(a)

5

In [5]:
a.dtypes

0    int32
dtype: object

In [6]:
type(a)

pandas.core.frame.DataFrame

In [7]:
a.values

array([[1],
       [2],
       [3],
       [4],
       [5]])

---

In [8]:
b = pd.DataFrame(np.array([[10, 11], [20, 21]]))
b

    0   1
0  10  11
1  20  21

In [9]:
b.shape

(2, 2)

In [10]:
b.size

4

In [11]:
b.dtypes

0    int32
1    int32
dtype: object

In [12]:
b.index

RangeIndex(start=0, stop=2, step=1)

In [13]:
b.columns # 沒有設定一樣產生一個 RangeIndex 物件來代表行

RangeIndex(start=0, stop=2, step=1)

In [14]:
b.values

array([[10, 11],
       [20, 21]])

---

In [15]:
c = pd.DataFrame(np.array([[70, 71], [90, 91]]), 
                 columns = ['Missoula', 'Philadelphia'],
                 index = ['a', 'b'])
c

   Missoula  Philadelphia
a        70            71
b        90            91

In [16]:
c.shape

(2, 2)

In [17]:
len(c) # 列的個數

2

In [18]:
c.columns

Index(['Missoula', 'Philadelphia'], dtype='object')

In [19]:
c.index

Index(['a', 'b'], dtype='object')

---

In [20]:
temps_missoula = [70, 71]
temps_philly =  [90, 91]
temperatures ={'Missoula': temps_missoula,
               'Philadephia': temps_philly}
d = pd.DataFrame(temperatures)
d

   Missoula  Philadephia
0        70           90
1        71           91

---

In [21]:
temps_at_time0 = pd.Series([70, 90], index = ['a', 'b'])
temps_at_time1 = pd.Series([71, 91], index = ['a', 'b'])
e = pd.DataFrame([temps_at_time0, temps_at_time1])
e

    a   b
0  70  90
1  71  91

In [22]:
e.columns

Index(['a', 'b'], dtype='object')

In [23]:
e.columns = ['Missoula', 'Philadephia']

In [24]:
e

   Missoula  Philadephia
0        70           90
1        71           91

---

In [25]:
temps_mso_series = pd.Series([70, 71], index = ['a', 'b'])
temps_phl_series = pd.Series([90, 91], index = ['a', 'b'])
f = pd.DataFrame({'Missoula': temps_mso_series,
                 'Philadephia': temps_phl_series})
f

   Missoula  Philadephia
a        70           90
b        71           91

In [26]:
f.index = e.index

In [27]:
f

   Missoula  Philadephia
0        70           90
1        71           91

---

In [28]:
# 在建構 Dataframe 時，Series 會被對齊

temps_mso_series = pd.Series([70, 71])
temps_phl_series = pd.Series([90, 91])
temps_nyc_series = pd.Series([85, 87], index = [1, 2])
f = pd.DataFrame({'Missoula': temps_mso_series,
                 'Philadephia': temps_phl_series,
                 'New York': temps_nyc_series})
f

   Missoula  Philadephia  New York
0      70.0         90.0       NaN
1      71.0         91.0      85.0
2       NaN          NaN      87.0

---

In [29]:
# 使用 pd.read_csv 讀取 csv 檔案建立資料框
# pandas 能夠讀取更多不同類型的檔案來建立資料框，之後會詳細介紹

sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

In [30]:
len(sp500)

500

In [31]:
sp500.shape

(500, 3)

In [32]:
sp500.size

1500

In [33]:
sp500.index

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ACT', 'ADBE', 'AES', 'AET', 'AFL',
       ...
       'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM', 'ZMH', 'ZION', 'ZTS'],
      dtype='object', name='Symbol', length=500)

In [34]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

## 選擇資料框的行

In [35]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [36]:
a = sp500['Sector']
a.head()

Symbol
MMM                Industrials
ABT                Health Care
ABBV               Health Care
ACN     Information Technology
ACE                 Financials
Name: Sector, dtype: object

In [37]:
type(a) # 從 Dataframe 提取的一行就是 Series

pandas.core.series.Series

In [38]:
b = sp500[['Price', 'Book Value']] # 記得要加 list
b.head()

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897

In [39]:
type(b) # 從 Dataframe 提取多行就還會是 Dataframe

pandas.core.frame.DataFrame

In [40]:
c = sp500[['Sector']] # 提取一行也希望是 Dataframe，只要多加一個 List 即可
c.head()

                        Sector
Symbol
MMM                Industrials
ABT                Health Care
ABBV               Health Care
ACN     Information Technology
ACE                 Financials

In [41]:
sp500.Price # 用屬性的方式來提取行 # 限制比較多 # 比如行的名稱有空格無法使用

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
         ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53
Name: Price, Length: 500, dtype: float64

## 選擇資料框的列

In [42]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [43]:
# 傳入索引標籤值，利用 .loc[] 來提取
a = sp500.loc['MMM']
a

Sector        Industrials
Price              141.14
Book Value         26.668
Name: MMM, dtype: object

In [44]:
type(a) # 從 Dataframe 提取的一列就是 Series

pandas.core.series.Series

In [45]:
b = sp500.loc[['MMM', 'MSFT']]
b

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
MSFT    Information Technology   40.12      10.584

In [46]:
type(b) # 從 Dataframe 提取多列就還會是 Dataframe

pandas.core.frame.DataFrame

In [47]:
c = sp500.loc[['MMM']] # 提取一列也希望是 Dataframe，只要多加一個 List 即可
c

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668

---

In [48]:
# 傳入位置值，利用 .iloc[] 來提取

c = sp500.iloc[[0, 2]]
c

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954

In [49]:
i1 = sp500.index.get_loc('MMM')
i2 = sp500.index.get_loc('A')
print(i1)
print(i2)

0
10

In [50]:
d = sp500.iloc[[i1, i2]]
d

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
A       Health Care   56.18      16.928

## 利用 .at[ ] 及 .iat[ ] ，以標籤或位置進行純量查詢

In [51]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [52]:
a = sp500.at['MMM', 'Price'] # 利用索引標籤
a

141.14

In [53]:
b = sp500.iat[0, 1] # 利用位置
b

141.14

---

In [54]:
sp500.loc['MMM'].loc['Price']

141.14

In [55]:
sp500['Price'].loc['MMM']

141.14

## 利用 [ ]、.loc[ ]、.iloc[ ] 運算子做切割(Slicing)

In [56]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [57]:
sp500[:3] # 使用位置，對列切割

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

In [58]:
# [] 運算子只能對列做切片
sp500[:3, :2]

TypeError: '(slice(None, 3, None), slice(None, 2, None))' is an invalid key

In [60]:
sp500['ABT':'ACN']

                        Sector  Price  Book Value
Symbol
ABT                Health Care  39.60      15.573
ABBV               Health Care  53.95       2.954
ACN     Information Technology  79.79       8.326

In [61]:
# [] 運算子只能對列做切片
sp500['ABT':'ACN', 'Sector':'Price']

TypeError: '(slice('ABT', 'ACN', None), slice('Sector', 'Price', None))' is an invalid key

In [ ]:
sp500.iloc[:3]

In [ ]:
sp500.iloc[:3, :2]

In [ ]:
sp500.loc['ABT':'ACN']

In [ ]:
# 索引標籤的切片會包含最後一項
sp500.loc['ABT':'ACN', 'Sector':'Price']

---

In [ ]:
df = pd.DataFrame(np.arange(9).reshape(3, 3), index = [3, 4, 5])
df

In [ ]:
df[:2]

## 利用布林選擇選取列

In [ ]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

In [ ]:
# 找出股價小於 100 的股票
a = sp500.Price < 100
a

In [ ]:
b = sp500[a]
b

In [ ]:
# 提取價格在 6 到 10 之間的股票符號跟價格

c = sp500[(sp500.Price > 6) & (sp500.Price < 10)]['Price']
c

In [ ]:
# 找出 Sector 是 Health Care、Price >= 100 的所有列，且只要印出 Sector 和 Price

d = sp500[(sp500.Sector == 'Health Care') & (sp500.Price >= 100)][['Sector', 'Price']]
d

## 跨越行與列進行選取

In [ ]:
# 選取股票 ABT 與 ZTS，印出 Sector 與 Price
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

In [ ]:
a = sp500.loc[['ABT', 'ZTS']][['Sector', 'Price']] # 先選列，再選行
a

In [ ]:
b = sp500[['Sector', 'Price']].loc[['ABT', 'ZTS']] # 先選行，再選列
b

## 重新命名行

In [ ]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

In [ ]:
newSp500 = sp500.rename(columns = {'Book Value': 'BookValue'})
newSp500[:2]

In [ ]:
sp500 # not in-place

In [ ]:
sp500.rename(columns = {'Book Value': 'BookValue'}, inplace = True)

In [ ]:
sp500.columns

In [ ]:
# 沒有空格才可以用屬性的方式取欄位
sp500.BookValue[:5]

---

In [ ]:
sp500

In [ ]:
# 另一種改行名的方式
sp500.columns.values[2] = 'Book Value'

In [62]:
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

## 利用 [ ] 及 .insert() 方法增加新行

In [63]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [64]:
sp500_copy = sp500.copy()
sp500_copy['RoundedPrice'] = sp500.Price.round() # 會對齊 # 放在最後
sp500_copy[:2]

             Sector   Price  Book Value  RoundedPrice
Symbol
MMM     Industrials  141.14      26.668         141.0
ABT     Health Care   39.60      15.573          40.0

In [65]:
a = pd.DataFrame(np.array([[1, 2], [3, 4]]), index = ['a', 'b'], columns = ['Col1', 'Col2'])
a

   Col1  Col2
a     1     2
b     3     4

In [66]:
# 注意，會對齊
# 但是不會擴增列數
a['Col3'] = pd.Series([5, 6], index = ['a', 'c'])
a

   Col1  Col2  Col3
a     1     2   5.0
b     3     4   NaN

---

In [67]:
# .insert() 方法的優點是可以決定放的位置
# 如果 insert 重複的欄名會產生例外
copy = sp500.copy()
copy.insert(1, 'RoundedPrice', sp500.Price.round()) # in-place

In [68]:
copy[:5]

                        Sector  RoundedPrice   Price  Book Value
Symbol
MMM                Industrials         141.0  141.14      26.668
ABT                Health Care          40.0   39.60      15.573
ABBV               Health Care          54.0   53.95       2.954
ACN     Information Technology          80.0   79.79       8.326
ACE                 Financials         103.0  102.91      86.897

In [69]:
copy.insert(2, 'RoundedPrice', 1)

ValueError: cannot insert RoundedPrice, already exists

---

In [70]:
b = pd.DataFrame(np.array([[1, 2], [3, 4]]), index = ['a', 'b'], columns = ['Col1', 'Col2'])
b

   Col1  Col2
a     1     2
b     3     4

In [71]:
b.insert(1, 'Col3', pd.Series([5, 6], index = ['a', 'c']))
b

   Col1  Col3  Col2
a     1   5.0     2
b     3   NaN     4

## 利用擴展增加新行

In [72]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [73]:
sp500_copy = sp500.copy()
sp500_copy.loc[:, 'PER'] = 0
sp500_copy[:5]

                        Sector   Price  Book Value  PER
Symbol
MMM                Industrials  141.14      26.668    0
ABT                Health Care   39.60      15.573    0
ABBV               Health Care   53.95       2.954    0
ACN     Information Technology   79.79       8.326    0
ACE                 Financials  102.91      86.897    0

In [74]:
sp500_copy = sp500.copy()
np.random.seed(12345)
sp500_copy.loc[:,'PER'] = pd.Series(np.random.normal(size = len(sp500)), index = sp500.index)
sp500_copy[:10]

                        Sector   Price  Book Value       PER
Symbol
MMM                Industrials  141.14      26.668 -0.204708
ABT                Health Care   39.60      15.573  0.478943
ABBV               Health Care   53.95       2.954 -0.519439
ACN     Information Technology   79.79       8.326 -0.555730
ACE                 Financials  102.91      86.897  1.965781
ACT                Health Care  213.77      55.188  1.393406
ADBE    Information Technology   64.30      13.262  0.092908
AES                  Utilities   13.61       5.781  0.281746
AET                Health Care   76.39      40.021  0.769023
AFL                 Financials   61.31      34.527  1.246435

## 利用串連增加新行

In [75]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [76]:
rounded_price = pd.DataFrame({'RoundedPrice': sp500.Price.round()})
rounded_price[:5]

        RoundedPrice
Symbol
MMM            141.0
ABT             40.0
ABBV            54.0
ACN             80.0
ACE            103.0

In [77]:
concatenated = pd.concat([sp500, rounded_price], axis = 1) # not in place
concatenated[:5]

                        Sector   Price  Book Value  RoundedPrice
Symbol
MMM                Industrials  141.14      26.668         141.0
ABT                Health Care   39.60      15.573          40.0
ABBV               Health Care   53.95       2.954          54.0
ACN     Information Technology   79.79       8.326          80.0
ACE                 Financials  102.91      86.897         103.0

In [78]:
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

---

In [79]:
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

In [80]:
rounded_price = pd.DataFrame({'Price': sp500.Price.round()})
rounded_price

        Price
Symbol
MMM     141.0
ABT      40.0
ABBV     54.0
ACN      80.0
ACE     103.0
...       ...
YHOO     35.0
YUM      75.0
ZMH     102.0
ZION     28.0
ZTS      31.0

[500 rows x 1 columns]

In [81]:
dups = pd.concat([sp500, rounded_price], axis = 1) # 串連可以行名重複
dups[:5]

                        Sector   Price  Book Value  Price
Symbol
MMM                Industrials  141.14      26.668  141.0
ABT                Health Care   39.60      15.573   40.0
ABBV               Health Care   53.95       2.954   54.0
ACN     Information Technology   79.79       8.326   80.0
ACE                 Financials  102.91      86.897  103.0

In [82]:
dups.Price[:5] # 如果只想提取其中一個只能用位置來提取

         Price  Price
Symbol
MMM     141.14  141.0
ABT      39.60   40.0
ABBV     53.95   54.0
ACN      79.79   80.0
ACE     102.91  103.0

In [83]:
dups.iloc[:, 1]

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
         ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53
Name: Price, Length: 500, dtype: float64

## 改變行的順序

In [84]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [85]:
df_sp500 = sp500[['Sector', 'Book Value', 'Price']]
df_sp500

                        Sector  Book Value   Price
Symbol
MMM                Industrials      26.668  141.14
ABT                Health Care      15.573   39.60
ABBV               Health Care       2.954   53.95
ACN     Information Technology       8.326   79.79
ACE                 Financials      86.897  102.91
...                        ...         ...     ...
YHOO    Information Technology      12.768   35.02
YUM     Consumer Discretionary       5.147   74.77
ZMH                Health Care      37.181  101.84
ZION                Financials      30.191   28.43
ZTS                Health Care       2.150   30.53

[500 rows x 3 columns]

In [86]:
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

---

In [87]:
reversed_colnum_names = sp500.columns[::-1]
reversed_colnum_names

Index(['Book Value', 'Price', 'Sector'], dtype='object')

In [88]:
new_sp500 = sp500[reversed_colnum_names] # not in-place
new_sp500

        Book Value   Price                  Sector
Symbol
MMM         26.668  141.14             Industrials
ABT         15.573   39.60             Health Care
ABBV         2.954   53.95             Health Care
ACN          8.326   79.79  Information Technology
ACE         86.897  102.91              Financials
...            ...     ...                     ...
YHOO        12.768   35.02  Information Technology
YUM          5.147   74.77  Consumer Discretionary
ZMH         37.181  101.84             Health Care
ZION        30.191   28.43              Financials
ZTS          2.150   30.53             Health Care

[500 rows x 3 columns]

In [89]:
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

---

In [90]:
sp500.columns = reversed_colnum_names # 錯誤示範

In [91]:
sp500 # 只有名字換掉而已

                    Book Value   Price  Sector
Symbol
MMM                Industrials  141.14  26.668
ABT                Health Care   39.60  15.573
ABBV               Health Care   53.95   2.954
ACN     Information Technology   79.79   8.326
ACE                 Financials  102.91  86.897
...                        ...     ...     ...
YHOO    Information Technology   35.02  12.768
YUM     Consumer Discretionary   74.77   5.147
ZMH                Health Care  101.84  37.181
ZION                Financials   28.43  30.191
ZTS                Health Care   30.53   2.150

[500 rows x 3 columns]

## 取代行的內容

In [92]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [93]:
copy = sp500.copy()
rounded_price = sp500.Price.round()
rounded_price[:5]

Symbol
MMM     141.0
ABT      40.0
ABBV     54.0
ACN      80.0
ACE     103.0
Name: Price, dtype: float64

In [94]:
copy['Price'] = rounded_price
copy[:5]

                        Sector  Price  Book Value
Symbol
MMM                Industrials  141.0      26.668
ABT                Health Care   40.0      15.573
ABBV               Health Care   54.0       2.954
ACN     Information Technology   80.0       8.326
ACE                 Financials  103.0      86.897

---

In [95]:
copy = sp500.copy()
copy.loc[:, 'Price'] = rounded_price
copy[:5]

                        Sector  Price  Book Value
Symbol
MMM                Industrials  141.0      26.668
ABT                Health Care   40.0      15.573
ABBV               Health Care   54.0       2.954
ACN     Information Technology   80.0       8.326
ACE                 Financials  103.0      86.897

## 刪除行

In [96]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [97]:
copy = sp500.copy()
del copy['Book Value'] # in-place
copy[:5]

                        Sector   Price
Symbol
MMM                Industrials  141.14
ABT                Health Care   39.60
ABBV               Health Care   53.95
ACN     Information Technology   79.79
ACE                 Financials  102.91

---

In [98]:
copy = sp500.copy()
popped = copy.pop('Sector') # in-place
copy[:5]

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897

In [99]:
popped[:5] # 返回被刪的序列

Symbol
MMM                Industrials
ABT                Health Care
ABBV               Health Care
ACN     Information Technology
ACE                 Financials
Name: Sector, dtype: object

---

In [100]:
copy = sp500.copy()
afterdrop = copy.drop('Sector', axis = 1) # not in-place
afterdrop

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897
...        ...         ...
YHOO     35.02      12.768
YUM      74.77       5.147
ZMH     101.84      37.181
ZION     28.43      30.191
ZTS      30.53       2.150

[500 rows x 2 columns]

In [101]:
copy

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

In [102]:
afterdrop = copy.drop(['Sector', 'Book Value'], axis = 1) # 兩個以上要加上 list
afterdrop

         Price
Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
...        ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53

[500 rows x 1 columns]

In [103]:
copy

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

In [104]:
# 當 axis = 0 可以用來刪除列，後面會提到
copy.drop(['Sector', 'Book Value'], axis = 1, inplace = True) # in-place
copy

         Price
Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
...        ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53

[500 rows x 1 columns]

## 附加新列

In [105]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [106]:
df1 = sp500.iloc[0:3].copy()
df1

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

In [107]:
df2 = sp500.iloc[[10, 11, 2]]
df2

             Sector  Price  Book Value
Symbol
A       Health Care  56.18      16.928
GAS       Utilities  52.98      32.462
ABBV    Health Care  53.95       2.954

In [108]:
# 附加是對第 0 軸做串連，對第 1 軸做聯集對齊
# 索引標籤有可能因此重複
# .concat() 的功能較少的弱化版，有一章節會介紹
appended = df1.append(df2)   
appended

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954
A       Health Care   56.18      16.928
GAS       Utilities   52.98      32.462
ABBV    Health Care   53.95       2.954

---

In [109]:
df3 = pd.DataFrame(0.0, index = df1.index, columns = ['PER'])
df3

        PER
Symbol
MMM     0.0
ABT     0.0
ABBV    0.0

In [110]:
df1.append(df3) # 行會實行聯集 # 無資料的地方會補 NaN

             Sector   Price  Book Value  PER
Symbol
MMM     Industrials  141.14      26.668  NaN
ABT     Health Care   39.60      15.573  NaN
ABBV    Health Care   53.95       2.954  NaN
MMM             NaN     NaN         NaN  0.0
ABT             NaN     NaN         NaN  0.0
ABBV            NaN     NaN         NaN  0.0

In [111]:
df1.append(df3, ignore_index = True)

        Sector   Price  Book Value  PER
0  Industrials  141.14      26.668  NaN
1  Health Care   39.60      15.573  NaN
2  Health Care   53.95       2.954  NaN
3          NaN     NaN         NaN  0.0
4          NaN     NaN         NaN  0.0
5          NaN     NaN         NaN  0.0

## 列的串連

In [112]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [113]:
df1 = sp500.iloc[0:3].copy()
df1

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

In [114]:
df2 = sp500.iloc[[10, 11, 2]]
df2

             Sector  Price  Book Value
Symbol
A       Health Care  56.18      16.928
GAS       Utilities  52.98      32.462
ABBV    Health Care  53.95       2.954

In [115]:
pd.concat([df1, df2], axis = 0) # 跟 .append() 方法相同

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954
A       Health Care   56.18      16.928
GAS       Utilities   52.98      32.462
ABBV    Health Care   53.95       2.954

---

In [116]:
df2_2 = df2.copy()
df2_2

             Sector  Price  Book Value
Symbol
A       Health Care  56.18      16.928
GAS       Utilities  52.98      32.462
ABBV    Health Care  53.95       2.954

In [117]:
df2_2.insert(3, 'Foo', pd.Series(0, index = df2.index))
df2_2

             Sector  Price  Book Value  Foo
Symbol
A       Health Care  56.18      16.928    0
GAS       Utilities  52.98      32.462    0
ABBV    Health Care  53.95       2.954    0

In [118]:
df1

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

In [119]:
pd.concat([df1, df2_2], axis = 0)

             Sector   Price  Book Value  Foo
Symbol
MMM     Industrials  141.14      26.668  NaN
ABT     Health Care   39.60      15.573  NaN
ABBV    Health Care   53.95       2.954  NaN
A       Health Care   56.18      16.928  0.0
GAS       Utilities   52.98      32.462  0.0
ABBV    Health Care   53.95       2.954  0.0

In [120]:
pd.concat([df1, df2_2], axis = 0, keys = ['df1', 'df2']) # keys 可以區分某一組是來自於哪個資料框

                 Sector   Price  Book Value  Foo
    Symbol
df1 MMM     Industrials  141.14      26.668  NaN
    ABT     Health Care   39.60      15.573  NaN
    ABBV    Health Care   53.95       2.954  NaN
df2 A       Health Care   56.18      16.928  0.0
    GAS       Utilities   52.98      32.462  0.0
    ABBV    Health Care   53.95       2.954  0.0

## 經由擴展增加與取代列

In [121]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [122]:
copy =sp500[:3].copy()
copy

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

In [123]:
copy.loc['Foo'] = ['the sector', 100, 110] # in-place
copy

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954
Foo      the sector  100.00     110.000

In [124]:
# copy.loc['ABT'][ 'Sector'] = 'Industrials' 會產生例外
copy.loc['ABT', 'Sector'] = 'Industrials'

In [125]:
copy

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Industrials   39.60      15.573
ABBV    Health Care   53.95       2.954
Foo      the sector  100.00     110.000

## 使用 .drop() 方法移除列

In [126]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [127]:
ss = sp500[:5]
ss

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [128]:
afterdrop = ss.drop(['ABT', 'ACN'], axis = 0) # not in-place
afterdrop

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954
ACE      Financials  102.91      86.897

In [129]:
ss

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

## 利用布林選擇移除列

In [130]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [131]:
selection = sp500.Price > 300
~selection

Symbol
MMM     True
ABT     True
ABBV    True
ACN     True
ACE     True
        ...
YHOO    True
YUM     True
ZMH     True
ZION    True
ZTS     True
Name: Price, Length: 500, dtype: bool

In [132]:
# 500檔股票中，只有十檔大於 300 元
(len(selection), selection.sum())

(500, 10)

In [133]:
price_less_than_300 = sp500[~selection] # 使用補集符號　～
price_less_than_300

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[490 rows x 3 columns]

## 使用切割移除列

In [134]:
sp500 = pd.read_csv('./mod01/sp500.csv', index_col = 'Symbol', usecols = [0, 2, 3, 7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [135]:
only_first_three = sp500[:3] # view
only_first_three

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

In [136]:
only_first_three = sp500[:3].copy() # copy
only_first_three

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

## 綜合應用

In [137]:
dates = pd.date_range('2016-04-01', '2016-04-06')
dates

DatetimeIndex(['2016-04-01', '2016-04-02', '2016-04-03', '2016-04-04',
               '2016-04-05', '2016-04-06'],
              dtype='datetime64[ns]', freq='D')

In [138]:
temps1 = pd.Series([80, 82, 85, 90, 83, 87], index = dates)
temps1

2016-04-01    80
2016-04-02    82
2016-04-03    85
2016-04-04    90
2016-04-05    83
2016-04-06    87
Freq: D, dtype: int64

In [139]:
temps2 = pd.Series([70, 75, 69, 83, 79, 77], index = dates)
temps2

2016-04-01    70
2016-04-02    75
2016-04-03    69
2016-04-04    83
2016-04-05    79
2016-04-06    77
Freq: D, dtype: int64

In [140]:
temps_df = pd.DataFrame({'Missoula': temps1,
                         'Philadelphia': temps2})
temps_df

            Missoula  Philadelphia
2016-04-01        80            70
2016-04-02        82            75
2016-04-03        85            69
2016-04-04        90            83
2016-04-05        83            79
2016-04-06        87            77

In [141]:
temps_df['Missoula']

2016-04-01    80
2016-04-02    82
2016-04-03    85
2016-04-04    90
2016-04-05    83
2016-04-06    87
Freq: D, Name: Missoula, dtype: int64

In [142]:
temps_df['Philadelphia']

2016-04-01    70
2016-04-02    75
2016-04-03    69
2016-04-04    83
2016-04-05    79
2016-04-06    77
Freq: D, Name: Philadelphia, dtype: int64

In [143]:
temps_df[['Missoula', 'Philadelphia']]

            Missoula  Philadelphia
2016-04-01        80            70
2016-04-02        82            75
2016-04-03        85            69
2016-04-04        90            83
2016-04-05        83            79
2016-04-06        87            77

In [144]:
temps_df.Missoula

2016-04-01    80
2016-04-02    82
2016-04-03    85
2016-04-04    90
2016-04-05    83
2016-04-06    87
Freq: D, Name: Missoula, dtype: int64

In [145]:
# 會對齊
temp_diffs = temps_df.Missoula - temps_df.Philadelphia
temp_diffs

2016-04-01    10
2016-04-02     7
2016-04-03    16
2016-04-04     7
2016-04-05     4
2016-04-06    10
Freq: D, dtype: int64

In [146]:
temps_df['difference'] = temp_diffs
temps_df

            Missoula  Philadelphia  difference
2016-04-01        80            70          10
2016-04-02        82            75           7
2016-04-03        85            69          16
2016-04-04        90            83           7
2016-04-05        83            79           4
2016-04-06        87            77          10

In [147]:
temps_df.columns

Index(['Missoula', 'Philadelphia', 'difference'], dtype='object')

In [148]:
temps_df.difference[1:4]

2016-04-02     7
2016-04-03    16
2016-04-04     7
Freq: D, Name: difference, dtype: int64

In [149]:
temps_df.iloc[1]

Missoula        82
Philadelphia    75
difference       7
Name: 2016-04-02 00:00:00, dtype: int64

In [150]:
temps_df.iloc[1].index

Index(['Missoula', 'Philadelphia', 'difference'], dtype='object')

In [151]:
temps_df.loc['2016-04-05']

Missoula        83
Philadelphia    79
difference       4
Name: 2016-04-05 00:00:00, dtype: int64

In [152]:
temps_df.iloc[[1, 3, 5]].difference

2016-04-02     7
2016-04-04     7
2016-04-06    10
Freq: 2D, Name: difference, dtype: int64

In [153]:
temps_df.Missoula > 82

2016-04-01    False
2016-04-02    False
2016-04-03     True
2016-04-04     True
2016-04-05     True
2016-04-06     True
Freq: D, Name: Missoula, dtype: bool

In [154]:
temps_df[temps_df.Missoula > 82]

            Missoula  Philadelphia  difference
2016-04-03        85            69          16
2016-04-04        90            83           7
2016-04-05        83            79           4
2016-04-06        87            77          10

---

In [155]:
df = pd.read_csv('./mod01/goog.csv')
df

          Date        Open        High         Low       Close   Volume
0   12/19/2016  790.219971  797.659973  786.270020  794.200012  1225900
1   12/20/2016  796.760010  798.650024  793.270020  796.419983   925100
2   12/21/2016  795.840027  796.676025  787.099976  794.559998  1208700
3   12/22/2016  792.359985  793.320007  788.580017  791.260010   969100
4   12/23/2016  790.900024  792.739990  787.280029  789.909973   623400
..         ...         ...         ...         ...         ...      ...
56   3/13/2017  844.000000  848.684998  843.250000  845.539978  1149500
57   3/14/2017  843.640015  847.239990  840.799988  845.619995   779900
58   3/15/2017  847.590027  848.630005  840.770020  847.200012  1379600
59   3/16/2017  849.030029  850.849976  846.130005  848.780029   970400
60   3/17/2017  851.609985  853.400024  847.109985  852.119995  1712300

[61 rows x 6 columns]

In [156]:
df.Date

0     12/19/2016
1     12/20/2016
2     12/21/2016
3     12/22/2016
4     12/23/2016
         ...
56     3/13/2017
57     3/14/2017
58     3/15/2017
59     3/16/2017
60     3/17/2017
Name: Date, Length: 61, dtype: object

In [157]:
df.Date[0]

'12/19/2016'

In [158]:
type(df.Date[0])

str

In [159]:
#  Only booleans, lists, and dictionaries are accepted for the 'parse_dates' parameter
df = pd.read_csv('./mod01/goog.csv', parse_dates = ['Date'])
df

         Date        Open        High         Low       Close   Volume
0  2016-12-19  790.219971  797.659973  786.270020  794.200012  1225900
1  2016-12-20  796.760010  798.650024  793.270020  796.419983   925100
2  2016-12-21  795.840027  796.676025  787.099976  794.559998  1208700
3  2016-12-22  792.359985  793.320007  788.580017  791.260010   969100
4  2016-12-23  790.900024  792.739990  787.280029  789.909973   623400
..        ...         ...         ...         ...         ...      ...
56 2017-03-13  844.000000  848.684998  843.250000  845.539978  1149500
57 2017-03-14  843.640015  847.239990  840.799988  845.619995   779900
58 2017-03-15  847.590027  848.630005  840.770020  847.200012  1379600
59 2017-03-16  849.030029  850.849976  846.130005  848.780029   970400
60 2017-03-17  851.609985  853.400024  847.109985  852.119995  1712300

[61 rows x 6 columns]

In [160]:
type(df.Date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [161]:
df.index

RangeIndex(start=0, stop=61, step=1)

In [162]:
df = pd.read_csv('./mod01/goog.csv', parse_dates = ['Date'], index_col= 'Date')
df

                  Open        High         Low       Close   Volume
Date
2016-12-19  790.219971  797.659973  786.270020  794.200012  1225900
2016-12-20  796.760010  798.650024  793.270020  796.419983   925100
2016-12-21  795.840027  796.676025  787.099976  794.559998  1208700
2016-12-22  792.359985  793.320007  788.580017  791.260010   969100
2016-12-23  790.900024  792.739990  787.280029  789.909973   623400
...                ...         ...         ...         ...      ...
2017-03-13  844.000000  848.684998  843.250000  845.539978  1149500
2017-03-14  843.640015  847.239990  840.799988  845.619995   779900
2017-03-15  847.590027  848.630005  840.770020  847.200012  1379600
2017-03-16  849.030029  850.849976  846.130005  848.780029   970400
2017-03-17  851.609985  853.400024  847.109985  852.119995  1712300

[61 rows x 5 columns]

In [163]:
df.index

DatetimeIndex(['2016-12-19', '2016-12-20', '2016-12-21', '2016-12-22',
               '2016-12-23', '2016-12-27', '2016-12-28', '2016-12-29',
               '2016-12-30', '2017-01-03', '2017-01-04', '2017-01-05',
               '2017-01-06', '2017-01-09', '2017-01-10', '2017-01-11',
               '2017-01-12', '2017-01-13', '2017-01-17', '2017-01-18',
               '2017-01-19', '2017-01-20', '2017-01-23', '2017-01-24',
               '2017-01-25', '2017-01-26', '2017-01-27', '2017-01-30',
               '2017-01-31', '2017-02-01', '2017-02-02', '2017-02-03',
               '2017-02-06', '2017-02-07', '2017-02-08', '2017-02-09',
               '2017-02-10', '2017-02-13', '2017-02-14', '2017-02-15',
               '2017-02-16', '2017-02-17', '2017-02-21', '2017-02-22',
               '2017-02-23', '2017-02-24', '2017-02-27', '2017-02-28',
               '2017-03-01', '2017-03-02', '2017-03-03', '2017-03-06',
               '2017-03-07', '2017-03-08', '2017-03-09', '2017-03-10',
               '2017-03-13', '2017-03-14', '2017-03-15', '2017-03-16',
               '2017-03-17'],
              dtype='datetime64[ns]', name='Date', freq=None)

---

In [164]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3), 
                     index = ['a', 'c', 'd'],
                     columns = ['ohio', 'Texas', 'California']) 
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [165]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [166]:
frame3 = frame.reindex(['a', 'b', 'c', 'd'], columns = ['ohio', 'Utah'])
frame3

   ohio  Utah
a   0.0   NaN
b   NaN   NaN
c   3.0   NaN
d   6.0   NaN

In [167]:
frame4 = frame.reindex(['a', 'b', 'c', 'd'], columns = ['ohio', 'Utah'], fill_value = 0)
frame4

   ohio  Utah
a     0     0
b     0     0
c     3     0
d     6     0

In [168]:
frame5 = frame.reindex(['a', 'b', 'c', 'd'],  method = 'bfill')
frame5

   ohio  Texas  California
a     0      1           2
b     3      4           5
c     3      4           5
d     6      7           8

---

In [169]:
data = pd.DataFrame(np.arange(16).reshape(4, 4),
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [170]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [171]:
# True 的才會取到值
data[data < 5]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [172]:
# 把資料框裡的資料小於 5 的都變成 0 的方法
data[data < 5] = 0 
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15